Config/Documents/РешениеОПроведенииИнвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РешениеОПроведенииИнвентаризации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПроведенияИнвентаризации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияПроведенияИнвентаризации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписиРуководитель</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписиОтветственный</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласующиеЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СогласующиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИнвентаризации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРабочейКомиссии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоИнвентаризации</Name>
							<Comment>Место проведения инвентаризации</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.МестоИнвентаризацииНФА</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комиссия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПостоянноДействующиеКомиссии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АктыОПроведенииИнвентаризации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛистСогласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛистОзнакомления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СотрудникДляОзнакомления</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccountingRegisters/ЖурналПроводокЕПСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>ЖурналПроводокЕПСБУ</Name>
			<ChartOfAccounts>ChartOfAccounts.ЕПСБУ</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКПС</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоКЭК</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖурналОпераций</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Журналы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНеУчитываетсяНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНеУчитываемых</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЕНВД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетЕНВД</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<AccountingFlag>ChartOfAccounts.ЕПСБУ.AccountingFlag.НалоговыйУчетНДС</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.ЕПСБУ.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияДт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаДвиженияКт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМежотчетногоПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМежотчетногоПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Config/Documents/РешениеОПроведенииИнвентаризации/Forms/ПодборОстатковНФА/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрименитьПараметры();
	
	ПоАналитическимСчетам = Ложь;
	УровеньГруппСчетов = 1;
	
	ВключатьСтруктурноеПодразделение = ЗначениеЗаполнено(СтруктурноеПодразделение);
	
	ВключатьМестонахождение = Истина;
	ВключатьМестоХранения = Истина;
	МестонахождениеВОтдельныхСтроках = Истина;
	
	ЗаполнитьСчетаСервер();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьПредставленияСписков();
	
	ОбновитьТекстШаблона();
	
	НастроитьФорму_УровеньГруппСчетов();
	
	НастроитьФорму_СтруктурноеПодразделение();
	
	НастроитьФорму_МестонахождениеОбъектаНФА();
	
	НастроитьФорму_ИспользоватьТекстовуюСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВыбранноеЗначение = Неопределено Или Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
		Если СписокМОЛ.НайтиПоЗначению(ВыбранноеЗначение) = Неопределено Тогда
			СписокМОЛ.Добавить(ВыбранноеЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивЗначений = ВыбранноеЗначение.ВыгрузитьЗначения();
	
	ТипЗначения = ТипЗнч(МассивЗначений[0]);
	
	Если ТипЗначения = Тип("ПеречислениеСсылка.КВД") Тогда
		СписокКФО.ЗагрузитьЗначения(МассивЗначений);
		
		ОбновитьПредставленияСписков("СписокКФО");
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	
	ЗаполнитьСчетаКлиент();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокКФОПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок", "Подбор КФО");
	ПараметрыФормы.Вставить("ИсходныйСписок", СписокКФО);
	ПараметрыФормы.Вставить("ТипИсточника", "Запрос");
	ПараметрыФормы.Вставить("ТипВыбираемогоЗначения", Новый ОписаниеТипов("ПеречислениеСсылка.КВД"));
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораЗначенийВСписок", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОчиститьСписокКФОНажатие(Элемент)
	
	СписокКФО.Очистить();
	
	ОбновитьПредставленияСписков("СписокКФО");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОчиститьСписокСчетовНажатие(Элемент)
	
	СписокСчетов.Очистить();
	
	ОбновитьПредставленияСписков("СписокСчетов");
	
КонецПроцедуры


&НаКлиенте
Процедура ПоАналитическимСчетамПриИзменении(Элемент)
	
	Если ПоАналитическимСчетам Тогда
		УровеньГруппСчетов = 0;
	Иначе
		УровеньГруппСчетов = 1;
	КонецЕсли;
	
	НастроитьФорму_УровеньГруппСчетов();
	
КонецПроцедуры


&НаКлиенте
Процедура СписокСчетовПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВыбранныеЗначения", СписокСчетов.ВыгрузитьЗначения());
	ПараметрыФормы.Вставить("ЗначенияДляВыбора", СписокСчетовЭталон.ВыгрузитьЗначения());
	
	ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("ВыбранСписокСчетов", ЭтотОбъект);
	
	ОткрытьФорму("Документ.РешениеОПроведенииИнвентаризации.Форма.ПодборСчетов", ПараметрыФормы,,,,,ОписаниеОповещенияВыбор, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСправочникМестаХраненияПриИзменении(Элемент)
	
	НастроитьФорму_ИспользоватьТекстовуюСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьСтруктурноеПодразделениеПриИзменении(Элемент)
	
	ОбновитьТекстШаблона();
	
	НастроитьФорму_СтруктурноеПодразделение();
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктурноеПодразделениеПриИзменении(Элемент)
	
	ВключатьСтруктурноеПодразделение = ЗначениеЗаполнено(СтруктурноеПодразделение);
	
	ОбновитьТекстШаблона();
	
	НастроитьФорму_СтруктурноеПодразделение();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьМестонахождениеПриИзменении(Элемент)
	
	ОбновитьТекстШаблона();
	
	НастроитьФорму_МестонахождениеОбъектаНФА();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьМестоХраненияПриИзменении(Элемент)
	
	ОбновитьТекстШаблона();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокМОЛ

&НаКлиенте
Процедура СписокМОЛЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура());
	ПараметрыФормы.Отбор.Вставить("Владелец", Организация);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Остатки

&НаКлиенте
Процедура ОстаткиПриИзменении(Элемент)
	
	КоличествоСтрокОстатков = Остатки.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиМестоИнвентаризацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Остатки.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец"));
	ПараметрыФормы.Отбор.Владелец = Организация;
	
	ОткрытьФорму("Справочник.МестаХранения.ФормаВыбора", ПараметрыФормы, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиМестоИнвентаризацииОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Остатки.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнвентаризацияКлиент.ПриОткрытииМестаИнвентаризации(ЭтаФорма, ТекДанные, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьСотрудника(Команда)
	
	ПодобратьСотрудникаКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатки(Команда)
	
	ПроверитьИЗаполнитьОстаткиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ПроверитьИПеренестиВДокументКлиент();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрименитьПараметры()
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "НаДату,Организация,СтруктурноеПодразделение");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//---
	// Вывод 0 в пустой колонке КФО
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Вывод 0 в пустой колонке КФО'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Остатки.КФО");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "0");
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОстаткиКФО");
	
	
	//---
	// Форматирование колонки Количество, 0
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Форматирование колонки Количество, 0'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Остатки.ТочностьКоличества");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = 0;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", СтрШаблон("ЧЦ=15;ЧДЦ=0"));
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОстаткиКоличествоОстаток");
	
	
	//---
	// Форматирование колонки Количество, 3
	//---
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Представление = НСтр("ru='Форматирование колонки Количество, 3'");
	
	// Условия
	Условие = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Условие.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Остатки.ТочностьКоличества");
	Условие.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Условие.ПравоеЗначение = 3;
	
	// Оформление
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", СтрШаблон("ЧЦ=15;ЧДЦ=3"));
	
	// Оформляемые поля
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОстаткиКоличествоОстаток");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФорму_УровеньГруппСчетов()
	
	Элементы.УровеньГруппСчетов.Доступность = Не ПоАналитическимСчетам;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФорму_МестонахождениеОбъектаНФА()
	
	Элементы.ВключатьМестоХранения.Доступность = ВключатьМестонахождение;
	
	Элементы.МестонахождениеВОтдельныхСтроках.Доступность = ВключатьМестонахождение;
	
КонецПроцедуры
	
&НаКлиенте
Процедура НастроитьФорму_СтруктурноеПодразделение()
	
	Элементы.СтруктурноеПодразделение.Доступность = ВключатьСтруктурноеПодразделение;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьФорму_ИспользоватьТекстовуюСтроку()
	
	Элементы.ГруппаНастройкиМестаИнвентаризации.ТекущаяСтраница = ?(ИспользоватьТекстовуюСтроку,
		Элементы.ГруппаИспользоватьТекстовуюСтроку,
		Элементы.ГруппаИспользоватьСправочникМестаХранения);
		
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьПредставленияСписков(ИмяСписка = Неопределено)
	
	Если ИмяСписка = "СписокКФО" Или ИмяСписка = Неопределено Тогда
		СписокКФОПредставление = ПолучитьПредставлениеСписка(СписокКФО, 14);
		
		Элементы.СписокКФОПредставление.Ширина = СтрДлина(СписокКФОПредставление);
		
		КоличествоКФО = СписокКФО.Количество();
	КонецЕсли;
	
	Если ИмяСписка = "СписокСчетов" Или ИмяСписка = Неопределено Тогда
		СписокСчетовПредставление = ПолучитьПредставлениеСписка(СписокСчетов, 20);
		
		Элементы.СписокСчетовПредставление.Ширина = СтрДлина(СписокСчетовПредставление);
		
		КоличествоСчетов = СписокСчетов.Количество();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПредставлениеСписка(Список, МаксимальнаяДлина = 14)
	
	Если Список.Количество() = 0 Тогда
		Возврат ПолучитьПредставлениеПустогоСписка();
	КонецЕсли;
	
	ПредставлениеРазделителя = ПолучитьПредставлениеРазделителя();
	
	Представление = "";
	
	Для Каждого Элемент Из Список Цикл
		ПредставлениеЭлемента = ?(Представление = "", "", ПредставлениеРазделителя) + Строка(Элемент.Значение);
		
		Если СтрДлина(Представление) + СтрДлина(ПредставлениеЭлемента) > МаксимальнаяДлина Тогда
			Возврат Представление + ПолучитьПредставлениеНезавершенногоПредставления();
		КонецЕсли;
		
		Представление = Представление + ПредставлениеЭлемента;
	КонецЦикла;
	
	Возврат Представление;
	
КонецФункции

&НаКлиенте
Функция ПолучитьПредставлениеПустогоСписка()
	
	Возврат НСтр("ru='<без отбора>'");
	
КонецФункции

&НаКлиенте
Функция ПолучитьПредставлениеРазделителя()
	
	Возврат ";";
	
КонецФункции

&НаКлиенте
Функция ПолучитьПредставлениеНезавершенногоПредставления()
	
	Возврат "...";
	
КонецФункции


&НаКлиенте
Процедура ПодобратьСотрудникаКлиент()
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("Отбор", Новый Структура());
	ПараметрыФормы.Отбор.Вставить("Владелец", Организация);
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьСчетаКлиент()
	
	ЗаполнитьСчетаСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСчетаСервер()
	
	ВидыСубконтоМОЛ = Новый Массив();
	ВидыСубконтоМОЛ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
	
	ВидыСубконтоОС = Новый Массив();
	ВидыСубконтоОС.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	
	ВидыСубконтоМЗ = Новый Массив();
	ВидыСубконтоМЗ.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	
	ВидыСубконтоБСО = Новый Массив();
	ВидыСубконтоБСО.Добавить(ПланыВидовХарактеристик.ВидыСубконто.БСО);
	
	ВсеВидыСубконто = Новый Массив();
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеВидыСубконто, ВидыСубконтоМОЛ);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеВидыСубконто, ВидыСубконтоОС);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеВидыСубконто, ВидыСубконтоМЗ);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВсеВидыСубконто, ВидыСубконтоБСО);
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("ВсеВидыСубконто",	ВсеВидыСубконто);
	ЗапросПоиск.УстановитьПараметр("ВидыСубконтоМОЛ",	ВидыСубконтоМОЛ);
	ЗапросПоиск.УстановитьПараметр("ВидыСубконтоМЗ",	ВидыСубконтоМЗ);
	ЗапросПоиск.УстановитьПараметр("ВидыСубконтоОС",	ВидыСубконтоОС);
	ЗапросПоиск.УстановитьПараметр("ВидыСубконтоБСО",	ВидыСубконтоБСО);
	ЗапросПоиск.УстановитьПараметр("НаДату",			НаДату);
	ЗапросПоиск.УстановитьПараметр("ПустаяДата",		'00010101');
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	МАКСИМУМ(ВидСубконто В (&ВидыСубконтоМОЛ))	КАК ЕстьСубконтоМОЛ,
	|	МАКСИМУМ(ВидСубконто В (&ВидыСубконтоОС))	КАК ЕстьСубконтоОС,
	|	МАКСИМУМ(ВидСубконто В (&ВидыСубконтоМЗ))	КАК ЕстьСубконтоМЗ,
	|	МАКСИМУМ(ВидСубконто В (&ВидыСубконтоБСО))	КАК ЕстьСубконтоБСО
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто
	|ГДЕ
	|	ВидСубконто В(&ВсеВидыСубконто)
	|	И Ссылка.ДатаНачалаДействия <= &НаДату
	|	И (Ссылка.ДатаОкончанияДействия = &ПустаяДата
	|		ИЛИ Ссылка.ДатаОкончанияДействия >= &НаДату)	
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ВидСубконто В (&ВидыСубконтоМОЛ))
	|	И (МАКСИМУМ(ВидСубконто В (&ВидыСубконтоОС))
	|		ИЛИ МАКСИМУМ(ВидСубконто В (&ВидыСубконтоМЗ))
	|		ИЛИ МАКСИМУМ(ВидСубконто В (&ВидыСубконтоБСО)))
	|;";
	
	МассивСчетов = ЗапросПоиск.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	РодителиСчетов = ПолучитьРодителейСчетов(МассивСчетов);
	
	Для Каждого СтрокаТаблицы Из РодителиСчетов Цикл
		
		Для Счетчик = 1 По 4 Цикл
			Счет = СтрокаТаблицы["Родитель" + Счетчик];
			
			Если Не ЗначениеЗаполнено(Счет) Тогда
				Прервать;
			КонецЕсли;
			
			Если МассивСчетов.Найти(Счет) = Неопределено Тогда
				МассивСчетов.Добавить(Счет);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	СписокСчетовЭталон.ЗагрузитьЗначения(МассивСчетов);
	
	СписокСчетовЭталон.СортироватьПоЗначению();
	
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьИЗаполнитьОстаткиКлиент()
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(НаДату) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Инвентаризация по состоянию на"),
			,
			"НаДату",, Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Организация"),
			,
			"Организация",, Отказ);
	КонецЕсли;
	
	Если ВключатьСтруктурноеПодразделение И Не ЗначениеЗаполнено(СтруктурноеПодразделение) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Структурное подразделение"),
			,
			"СтруктурноеПодразделение",, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОстаткиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткиКлиент()
	
	ЗаполнитьОстаткиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиСервер()
	
	ТаблицаОстатков = ПрочитатьОстаткиПоМОЛ();
	
	Остатки.Очистить();
	
	Для Каждого СтрокаТаблицыОстатков Из ТаблицаОстатков Цикл
		
		НоваяСтрока = Остатки.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыОстатков);
		
		НоваяСтрока.ТочностьКоличества = ?(СтрокаТаблицыОстатков.СубконтоМЗ > 0, 3, 0);
		
	КонецЦикла;
	
	КоличествоСтрокОстатков = Остатки.Количество();
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьОстаткиПоМОЛ()
	
	ДатаОпределенияОстатков = Новый Граница(КонецДня(НаДату), ВидГраницы.Включая);
	
	ВидыСубконтоМОЛНоменклатура = Новый Массив();
	ВидыСубконтоМОЛНоменклатура.Добавить(ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
	ВидыСубконтоМОЛНоменклатура.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	
	СписокСчетовОтбор = ?(СписокСчетов.Количество() > 0, СписокСчетов.ВыгрузитьЗначения(), СписокСчетовЭталон.ВыгрузитьЗначения());
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("Организация",				Организация);
	ЗапросПоиск.УстановитьПараметр("СписокСчетов",				СписокСчетовОтбор);
	ЗапросПоиск.УстановитьПараметр("ВидСубконтоМОЛ",			ПланыВидовХарактеристик.ВидыСубконто.ЦМО);
	ЗапросПоиск.УстановитьПараметр("ВидСубконтоМЗ",				ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	ЗапросПоиск.УстановитьПараметр("ВидСубконтоОС",				ПланыВидовХарактеристик.ВидыСубконто.ОсновныеСредства);
	ЗапросПоиск.УстановитьПараметр("ВидСубконтоБСО",			ПланыВидовХарактеристик.ВидыСубконто.БСО);
	ЗапросПоиск.УстановитьПараметр("НаДату",					ДатаОпределенияОстатков);
	ЗапросПоиск.УстановитьПараметр("ИспользоватьОтборПоКФО",	СписокКФО.Количество() > 0);
	ЗапросПоиск.УстановитьПараметр("СписокКФО",					СписокКФО.ВыгрузитьЗначения());
	ЗапросПоиск.УстановитьПараметр("ИспользоватьОтборПоМОЛ",	СписокМОЛ.Количество() > 0);
	ЗапросПоиск.УстановитьПараметр("СписокМОЛ",					СписокМОЛ.ВыгрузитьЗначения());
	ЗапросПоиск.УстановитьПараметр("ВидыСубконтоМОЛНоменклатура", ВидыСубконтоМОЛНоменклатура);
	ЗапросПоиск.УстановитьПараметр("ИсключаемыеТипыНоменклатуры", Документы.ИнвентаризационнаяОписьНФА.ПолучитьИсключаемыеТипыНоменклатуры());
	ЗапросПоиск.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Счета для отбора остатков
	|//
	|ВЫБРАТЬ
	|	Ссылка	КАК Ссылка
	|ПОМЕСТИТЬ
	|	ВТСчета
	|ИЗ
	|	ПланСчетов.ЕПСБУ
	|ГДЕ
	|	Ссылка В ИЕРАРХИИ(&СписокСчетов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Признаки наличия субконто
	|//
	|ВЫБРАТЬ
	|	ВТСчета.Ссылка	КАК Ссылка,
	|	СУММА(ВЫБОР
	|		КОГДА ВидСубконто = &ВидСубконтоОС ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ)			КАК СубконтоОС,
	|	СУММА(ВЫБОР
	|		КОГДА ВидСубконто = &ВидСубконтоМЗ ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ)			КАК СубконтоМЗ,
	|	СУММА(ВЫБОР
	|		КОГДА ВидСубконто = &ВидСубконтоБСО ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ)			КАК СубконтоБСО
	|ПОМЕСТИТЬ
	|	Счета
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСчета КАК ВТСчета
	|		ПО ЕПСБУВидыСубконто.Ссылка = ВТСчета.Ссылка
	|ГДЕ
	|	ВидСубконто = &ВидСубконтоОС
	|	ИЛИ ВидСубконто = &ВидСубконтоМЗ
	|	ИЛИ ВидСубконто = &ВидСубконтоБСО
	|СГРУППИРОВАТЬ ПО
	|	ВТСчета.Ссылка
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|		КОГДА ВидСубконто = &ВидСубконтоОС ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ) > 0
	|	ИЛИ СУММА(ВЫБОР
	|		КОГДА ВидСубконто = &ВидСубконтоМЗ ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ) > 0
	|	ИЛИ СУММА(ВЫБОР
	|		КОГДА ВидСубконто = &ВидСубконтоБСО ТОГДА
	|			1
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Остатки по МОЛ
	|//
	|ВЫБРАТЬ
	|	КФО							КАК КФО,
	|	Счет						КАК Счет,
	|	ЦМО							КАК ЦМО,
	|	Сотрудник					КАК Сотрудник,
	|	МестоХраненияСсылка			КАК МестоХраненияСсылка,
	|	МестоХраненияНаименование	КАК МестоХраненияНаименование,
	|	АдресХранения				КАК АдресХранения,
	|	СубконтоМЗ					КАК СубконтоМЗ,
	|	СубконтоОС					КАК СубконтоОС,
	|	СубконтоБСО					КАК СубконтоБСО,
	|	СУММА(КоличествоОстаток)	КАК КоличествоОстаток
	|ИЗ
	|	(// Все остатки
	|	ВЫБРАТЬ
	|		КФО																		КАК КФО,
	|		Счет																	КАК Счет,
	|		Субконто1																КАК ЦМО,
	|		ВЫРАЗИТЬ(СправочникЦМО.Сотрудник КАК Справочник.Сотрудники)				КАК Сотрудник,
	|		ВЫРАЗИТЬ(СправочникЦМО.МестоХранения КАК Справочник.МестаХранения)		КАК МестоХраненияСсылка,
	|		ЕСТЬNULL(СправочникМестаХранения.Наименование, """")						КАК МестоХраненияНаименование,
	|		ЕСТЬNULL(СправочникМестаХраненияКонтактнаяИнформация.Представление, """")	КАК АдресХранения,
	|		Счета.СубконтоМЗ														КАК СубконтоМЗ,
	|		Счета.СубконтоОС														КАК СубконтоОС,
	|		Счета.СубконтоБСО														КАК СубконтоБСО,
	|		КоличествоОстаток														КАК КоличествоОстаток
	|	ИЗ
	|		РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&НаДату,
	|			Счет В (ВЫБРАТЬ Ссылка ИЗ Счета),
	|			&ВидСубконтоМОЛ,
	|			Организация В(&Организация)
	|			И ВЫБОР
	|				КОГДА &ИспользоватьОтборПоКФО ТОГДА
	|					КФО В (&СписокКФО)
	|				ИНАЧЕ
	|					ИСТИНА
	|			КОНЕЦ
	|			И ВЫБОР
	|				КОГДА &ИспользоватьОтборПоМОЛ ТОГДА
	|					ВЫРАЗИТЬ(Субконто1 КАК Справочник.ЦМО).Сотрудник В (&СписокМОЛ)
	|				ИНАЧЕ
	|					ИСТИНА
	|			КОНЕЦ) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Счета
	|			ПО Остатки.Счет = Счета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК СправочникЦМО
	|			ПО Остатки.Субконто1 = СправочникЦМО.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаХранения КАК СправочникМестаХранения
	|			ПО СправочникЦМО.МестоХранения = СправочникМестаХранения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаХранения.КонтактнаяИнформация КАК СправочникМестаХраненияКонтактнаяИнформация
	|			ПО СправочникМестаХранения.Ссылка = СправочникМестаХраненияКонтактнаяИнформация.Ссылка
	|			И СправочникМестаХраненияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаХранения)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	// Исключаемые остатки МЗ
	|	ВЫБРАТЬ
	|		КФО																		КАК КФО,
	|		Счет																	КАК Счет,
	|		Субконто1																КАК ЦМО,
	|		ВЫРАЗИТЬ(СправочникЦМО.Сотрудник КАК Справочник.Сотрудники)				КАК Сотрудник,
	|		ВЫРАЗИТЬ(СправочникЦМО.МестоХранения КАК Справочник.МестаХранения)		КАК МестоХраненияСсылка,
	|		ЕСТЬNULL(СправочникМестаХранения.Наименование, """")						КАК МестоХраненияНаименование,
	|		ЕСТЬNULL(СправочникМестаХраненияКонтактнаяИнформация.Представление, """")	КАК АдресХранения,
	|		Счета.СубконтоМЗ														КАК СубконтоМЗ,
	|		Счета.СубконтоОС														КАК СубконтоОС,
	|		Счета.СубконтоБСО														КАК СубконтоБСО,
	|		-КоличествоОстаток														КАК КоличествоОстаток
	|	ИЗ
	|		РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|			&НаДату,
	|			Счет В (ВЫБРАТЬ Ссылка ИЗ Счета),
	|			&ВидыСубконтоМОЛНоменклатура,
	|			Организация В(&Организация)
	|			И ВЫБОР
	|				КОГДА &ИспользоватьОтборПоКФО ТОГДА
	|					КФО В (&СписокКФО)
	|				ИНАЧЕ
	|					ИСТИНА
	|			КОНЕЦ
	|			И ВЫБОР
	|				КОГДА &ИспользоватьОтборПоМОЛ ТОГДА
	|					ВЫРАЗИТЬ(Субконто1 КАК Справочник.ЦМО).Сотрудник В (&СписокМОЛ)
	|				ИНАЧЕ
	|					ИСТИНА
	|			КОНЕЦ
	|			И ВЫРАЗИТЬ(Субконто2 КАК Справочник.Номенклатура).ТипНоменклатуры В(&ИсключаемыеТипыНоменклатуры)
	|			) КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Счета
	|			ПО Остатки.Счет = Счета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЦМО КАК СправочникЦМО
	|			ПО Остатки.Субконто1 = СправочникЦМО.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаХранения КАК СправочникМестаХранения
	|			ПО СправочникЦМО.МестоХранения = СправочникМестаХранения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МестаХранения.КонтактнаяИнформация КАК СправочникМестаХраненияКонтактнаяИнформация
	|			ПО СправочникМестаХранения.Ссылка = СправочникМестаХраненияКонтактнаяИнформация.Ссылка
	|			И СправочникМестаХраненияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресМестаХранения)
	|	) КАК ВТ
	|СГРУППИРОВАТЬ ПО
	|	КФО,
	|	Счет,
	|	ЦМО,
	|	Сотрудник,
	|	МестоХраненияСсылка,
	|	МестоХраненияНаименование,
	|	АдресХранения,
	|	СубконтоМЗ,
	|	СубконтоОС,
	|	СубконтоБСО
	|ИМЕЮЩИЕ
	|	СУММА(КоличествоОстаток) > 0";
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаОстатков = ЗапросПоиск.Выполнить().Выгрузить();
	
	ПрименитьДетализациюПоКФО(ТаблицаОстатков);
	
	ПрименитьДетализациюПоСчетам(ТаблицаОстатков);
	
	ЗаполнитьМестоИнвентаризации(ТаблицаОстатков);
	
	ТаблицаОстатков.Свернуть("КФО,Счет,Сотрудник,МестоИнвентаризации,СубконтоМЗ,СубконтоОС", "КоличествоОстаток");
	
	ТаблицаОстатков.Сортировать("Счет,Сотрудник");
	
	Возврат ТаблицаОстатков;
	
КонецФункции

&НаСервере
Процедура ПрименитьДетализациюПоКФО(ТаблицаОстатков)
	
	Если ДетализацияКФО Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОстатков.ЗаполнитьЗначения(Перечисления.КВД.ПустаяСсылка(), "КФО");
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьДетализациюПоСчетам(ТаблицаОстатков)
	
	Если ПоАналитическимСчетам Тогда
		Возврат;
	КонецЕсли;
	
	РодителиСчетов = ПолучитьРодителейСчетов(ТаблицаОстатков.ВыгрузитьКолонку("Счет"));
	
	ТаблицаОстатков.Колонки.Добавить("НовыйСчет", Новый ОписаниеТипов("ПланСчетовСсылка.ЕПСБУ"));
	
	Для Каждого СтрокаТаблицыОстатков Из ТаблицаОстатков Цикл
		
		Счет = СтрокаТаблицыОстатков.Счет;
		
		СтрокаРодителейСчета = РодителиСчетов.Найти(Счет, "Ссылка");

		УровеньСчета = ПолучитьУровеньСчета(СтрокаРодителейСчета, РодителиСчетов);
		
		Если УровеньСчета > УровеньГруппСчетов Тогда
			ИмяПоляРодитель = СтрШаблон("Родитель%1", УровеньСчета - УровеньГруппСчетов);
			
			СтрокаТаблицыОстатков.НовыйСчет = СтрокаРодителейСчета[ИмяПоляРодитель];
		Иначе
			СтрокаТаблицыОстатков.НовыйСчет = Счет;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаОстатков.Колонки.Удалить("Счет");
	
	ТаблицаОстатков.Колонки.Найти("НовыйСчет").Имя = "Счет";
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРодителейСчетов(МассивСчетов)
	
	ЗапросПоиск = Новый Запрос();
	ЗапросПоиск.УстановитьПараметр("СписокСчетов", МассивСчетов);
	ЗапросПоиск.Текст = "
	|ВЫБРАТЬ
	|	Ссылка																								КАК Ссылка,
	|	ЕСТЬNULL(Ссылка.Родитель,								ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка))	КАК Родитель1,
	|	ЕСТЬNULL(Ссылка.Родитель.Родитель,						ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка))	КАК Родитель2,
	|	ЕСТЬNULL(Ссылка.Родитель.Родитель.Родитель,				ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка))	КАК Родитель3,
	|	ЕСТЬNULL(Ссылка.Родитель.Родитель.Родитель.Родитель,	ЗНАЧЕНИЕ(ПланСчетов.ЕПСБУ.ПустаяСсылка))	КАК Родитель4
	|ИЗ
	|	ПланСчетов.ЕПСБУ
	|ГДЕ
	|	Ссылка В(&СписокСчетов)";
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ЗапросПоиск.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьУровеньСчета(СтрокаРодителейСчета, РодителиСчетов)
	
	Для Счетчик = 1 По 4 Цикл
		
		ИмяПоляРодитель = СтрШаблон("Родитель%1", Счетчик);
		
		Если Не ЗначениеЗаполнено(СтрокаРодителейСчета[ИмяПоляРодитель]) Тогда
			Возврат Счетчик;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Счетчик + 1;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьМестоИнвентаризации(ТаблицаОстатков)
	
	Если Не ИспользоватьТекстовуюСтроку Тогда
		// Место инвентаризация задается справочником "Места хранения".
		
		ТаблицаОстатков.Колонки.МестоХраненияСсылка.Имя = "МестоИнвентаризации";
		
		Возврат;
	КонецЕсли;
	
	// Место инвентаризация задается Текстовой строкой.
	
	ТаблицаОстатков.Колонки.Добавить("МестоИнвентаризации", Новый ОписаниеТипов("Строка"));
	
	Если ПоляШаблона.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаОстатков Цикл
		
		ЗначенияПолей = Новый Массив();
		
		Для Каждого Элемент Из ПоляШаблона Цикл
			ИмяПоля = Элемент.Значение;
			
			Если ИмяПоля = "[СтруктурноеПодразделение]" И МестонахождениеВОтдельныхСтроках Тогда
				Если ВключатьСтруктурноеПодразделение И ЗначениеЗаполнено(СтруктурноеПодразделение) Тогда
					ЗначенияПолей.Добавить(СтруктурноеПодразделение);
				КонецЕсли;
				
			ИначеЕсли ИмяПоля = "[МестоХранения]" Тогда
				Если ВключатьМестонахождение И ВключатьМестоХранения И ЗначениеЗаполнено(СтрокаТаблицы.МестоХраненияНаименование) Тогда
					ЗначенияПолей.Добавить(СтрокаТаблицы.МестоХраненияНаименование);
				КонецЕсли;
				
			ИначеЕсли ИмяПоля = "[АдресХранения]" Тогда
				Если ВключатьМестонахождение И ЗначениеЗаполнено(СтрокаТаблицы.АдресХранения) Тогда
					ЗначенияПолей.Добавить(СтрокаТаблицы.АдресХранения);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокаТаблицы.МестоИнвентаризации = СтрСоединить(ЗначенияПолей, ", ");
		
	КонецЦикла;
	
	Если МестонахождениеВОтдельныхСтроках Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаСвернутая = ТаблицаОстатков.Скопировать(, "КФО,Счет,Сотрудник");
	ТаблицаСвернутая.Свернуть("КФО,Счет,Сотрудник");
	
	Поиск = Новый Структура("КФО,Счет,Сотрудник");
	
	Для Каждого СтрокаСвернутая Из ТаблицаСвернутая Цикл
		ЗаполнитьЗначенияСвойств(Поиск, СтрокаСвернутая);
		
		МассивСтрок = ТаблицаОстатков.НайтиСтроки(Поиск);
		
		ЗначенияПолей = Новый Массив();
		
		Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.МестоИнвентаризации) И ЗначенияПолей.Найти(СтрокаТаблицы.МестоИнвентаризации) = Неопределено Тогда
				ЗначенияПолей.Добавить(СтрокаТаблицы.МестоИнвентаризации);
			КонецЕсли;
		КонецЦикла;
		
		Если ВключатьСтруктурноеПодразделение И ЗначениеЗаполнено(СтруктурноеПодразделение) Тогда
			ЗначенияПолей.Вставить(0, СтруктурноеПодразделение);
		КонецЕсли;
		
		МестоИнвентаризации = СтрСоединить(ЗначенияПолей, ", ");
		
		Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
			СтрокаТаблицы.МестоИнвентаризации = МестоИнвентаризации;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИПеренестиВДокументКлиент()
	
	Если Остатки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Таблица остатков не заполнена, отсутствуют сведения для переноса в документ'"),
			,
			"Остатки");
		
		Возврат;
	КонецЕсли;
	
	ПеренестиВДокументКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокументКлиент()
	
	ПодготовитьВозвращаемоеЗначение();
	
	Закрыть(Параметры.АдресХранилища);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьВозвращаемоеЗначение()
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("ТаблицаОстатков",	Остатки.Выгрузить());
	ВозвращаемоеЗначение.Вставить("НаДату",				НаДату);
	
	ПоместитьВоВременноеХранилище(ВозвращаемоеЗначение, Параметры.АдресХранилища);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбранСписокСчетов(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	СписокСчетов.ЗагрузитьЗначения(ВыбранноеЗначение);
	
	ОбновитьПредставленияСписков("СписокСчетов");
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьТекстШаблона()
	
	МассивСтрок = Новый Массив();
	
	Если ВключатьСтруктурноеПодразделение Тогда
		МассивСтрок.Добавить("[СтруктурноеПодразделение]");
	КонецЕсли;
	
	Если ВключатьМестонахождение Тогда
		Если ВключатьМестоХранения Тогда
			МассивСтрок.Добавить("[МестоХранения]");
		КонецЕсли;
		
		МассивСтрок.Добавить("[АдресХранения]");
	КонецЕсли;
	
	ПоляШаблона.ЗагрузитьЗначения(МассивСтрок);
	
	Если ЗначениеЗаполнено(ПоляШаблона) Тогда
		ТекстШаблонаПредставление = СтрСоединить(МассивСтрок, ", ");
	Иначе
		ТекстШаблонаПредставление = НСтр("ru='<не заполняется>'");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВводаТекстовойСтроки(ВыбранноеЗначение, ДополнительныеПараметры)Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ТекДанные.МестоИнвентаризации = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти
